OdRxUnionTypeAttribute.typenames
\details
Gets the list of possible types.
\returns
Semicolon separated list of possible types.

OdRxUnionTypeAttribute.createObject(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Constructor. Creates an attribute that defines possible types of a property:
if it returns the values of the void type or OdRxObjectPtr type.
\param typenames [in]  Semicolon separated list of possible types.
\returns
Smart pointer to a constructed attribute object.